Revit 2027 API
BuiltInFailures.FamilyFailures.CannotRegenerateCorruptFamily Property
 Family [Family Name] is corrupt and its instances cannot be updated. Please reload the family to repair the project..
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRegenerateCorruptFamily { get; }
Public Shared ReadOnly Property CannotRegenerateCorruptFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRegenerateCorruptFamily {
	FailureDefinitionId^ get ();
}
static member CannotRegenerateCorruptFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace